import pymysql
import time
import random
#连接数据库
conn = pymysql.connect(host='127.0.0.1', port=3306, user='ESMicaiah', password='121303',database='test', charset='utf8')
cursor = conn.cursor(cursor=pymysql.cursors.DictCursor)
#系字典
dept = ['计算机系', '电子系', '机械系', '土木系', '化工系', '材料系', '经管系', '外语系', '数学系', '物理系', '化学系', '生物系', '音乐系', '美术系', '体育系', '新闻系', '法学系', '政治系', '教育系', '马克思主义学院', '国际教育学院', '基础教育学院', '体育教育学院', '艺术教育学院', '职业技术教育学院', '继续教育']
#课程、编号、学分
course = ['高等数学', '线性代数', '大学英语', '大学物理', '大学化学', '大学生心理健康教育', '数据库原理', '计算机组成原理', '计算机网络', '数据结构', '操作系统', '软件工程', '计算机图形学', 'C++', 'Python', 'Java', '密码学原理', '汇编语言', '数字逻辑', '微机原理', '电路分析', '电子技术基础', '电子线路', '电子元器件', '电子电路', '电子测量', '通用电气技术', '电力系统', '电力电子技术', '电力电子技术实验', '电力系统实验', '电力系统分析', '电力系统分析实验', '电力系统保护', '电力系统保护实验', '电力系统自动化', '电力系统自动化实验', '电力系统计算机辅助', '电力系统计算机辅助实验', '电力系统工程管理', '电力系统工程管理实验', '电力系统工程经济', '电力系统工程经济实验', '电力系统工程法规', '电力系统工程法规实验', '电力系统工程概论', '电力系统工程概论实验', '电力系统工程实习', '电力系统工程实习实验', '电力系统工程实训', '工商管理', '市场营销', '财务管理', '人力资源管理', '管理学', '管理信息系统', '工程管理', '工程经济', '工程统计', '工程数学', '工程物理', '工程力学', '工程材料', '工程制图', '工程测量', '工程计算机', '工程计算机实验', '工程计算机辅助设计', '工程计算机辅助设计实验', '工程计算机辅助制图', '工程计算机辅助制图实验', '工程计算机辅助测量', '工程计算机辅助测量实验', '工程计算机辅助分析', '工程计算机辅助分析实验', '工程计算机辅助设计与制图', '工程计算机辅助设计与制图实验', '工程计算机辅助设计与测量', '工程计算机辅助设计与测量实验', '工程计算机辅助设计与分析', '工程计算机辅助设计与分析实验', '工程计算机辅助制图与测量', '工程计算机辅助制图与测量实验', '工程计算机辅助制图与分析', '工程计算机辅助制图与分析实验', '工程计算机辅助测量与分析', '工程计算机辅助测量与分析实验', '工程计算机辅助设计与制图与测量', '工程计算机辅助设计与制图与测量实验', '工程计算机辅助设计与制图与分析', '工程计算机辅助设计与制图与分析实验', '环境工程', '环境科学', '环境工程实验', '环境科学实验', '环境工程概论', '环境科学概论', '新能源技术']
#姓名字典
name = ['赵', '钱', '孙', '李', '周', '吴', '郑', '王', '冯', '陈', '褚', '卫', '蒋', '沈', '韩', '杨', '朱', '秦', '尤', '许', '何', '吕', '施', '张', '孔', '曹', '严', '华', '金', '魏', '陶', '姜', '戚', '谢', '邹', '喻', '柏', '水', '窦', '章', '云', '苏', '潘', '葛', '奚', '范', '彭', '郎', '鲁', '韦', '昌', '马', '苗', '凤', '花', '方', '俞', '任', '袁', '柳', '酆', '鲍', '史', '唐', '费', '廉', '岑', '薛', '雷', '贺', '倪', '汤', '滕', '殷', '罗', '毕', '郝', '邬', '安', '常', '乐', '于', '时', '傅', '皮', '卞', '齐', '康', '伍', '余', '元', '卜', '顾', '孟', '平', '黄', '和', '穆', '萧', '尹', '姚', '邵', '湛', '汪', '祁', '毛', '禹', '狄', '米', '贝', '明', '臧', '计', '伏', '成', '戴', '谈', '宋', '茅', '庞', '熊', '纪', '舒', '屈', '项', '祝']
if __name__ == '__main__':
    #将课程导入数据库
    for i in range(len(course)):
        #生成随机先行课数量Cpno
        Cpno = random.randint(0, 5)
        credit = random.randint(2, 5)
        course_id = 1000 + i
        sql="insert into Course(Cno,Cname,Ccredit,Cpno) values('%s','%s','%d','%d')"%(course_id,course[i],credit,Cpno)
        cursor.execute(sql)
        conn.commit()
    n=int (input("请输入学生人数："))
    for i in range(n):
        #随机生成2017-2023年的学号
        year = random.randint(2017, 2023)
        Sno = year * 1000 + i + 1
        #随机生成姓名2-4个字
        random_int=random.randint(2,4)
        Sname = ''
        for j in range(random_int):
            Sname = Sname + random.choice(name)
        Ssex = random.choice(['男', '女'])
        Sage = 2023 - year + 18
        Sdept = random.choice(dept)

        #插入学生信息
        sql = "insert into Student(Sno,Sname,Ssex,Sage,Sdept) values('%s','%s','%s','%d','%s')" % (Sno, Sname, Ssex, Sage, Sdept)
        cursor.execute(sql)
        conn.commit()
        #随机课程数量
        count = random.randint(0, 6)
        #随机选课且不重复
        list=random.sample(course,count)
        for j in range(count):     
            grade = random.randint(30, 100)
            Cno = 1000 + course.index(list[j])
            sql = "insert into SC(Sno,Cno,Grade) values('%s','%s','%d')" % (Sno, Cno, grade)
            cursor.execute(sql)
            conn.commit()
    cursor.close()
    conn.close()
    #创建一个给出学生的姓名、课程名和成绩的视图
    sql = "create view view1 as select Sname,Cname,Grade from Student,SC,Course where Student.Sno=SC.Sno and SC.Cno=Course.Cno"